Project/Toir/src/Reports/гкс_СостояниеОборудования/гкс_СостояниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_СостояниеОборудования</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ЗначенияКонтролируемыхПоказателей/торо_ЗначенияКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКонтролируемыхПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <resources>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыОбъектовRCM</name>
  <enumValues>
    <name>Объект</name>
  </enumValues>
  <enumValues>
    <name>ФункциональноеМесто</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Reports/гкс_СостояниеОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина; 
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;    
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = ЗагрузитьНастройкиПриИзмененииПараметров();
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек.
//
// Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//   В ДополнительныеСвойства параметра НовыеНастройкиКД и свойство Настройки компоновщика настроек
//   объекта включены свойства КлючВарианта, КлючПредопределенногоВарианта, КонтекстВарианта 
//   и ФормаПараметрыОтбор.
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже.
//       Может не использоваться если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда пользовательские настройки не надо загружать (уже загружены ранее).
//
// Примеры:
// 1. Компоновщик отчета инициализируется на основании схемы из общих макетов:
//	Если КлючСхемы <> "1" Тогда
//		КлючСхемы = "1";
//		СхемаКД = ПолучитьОбщийМакет("МояОбщаяСхемаКомпоновки");
//		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//	КонецЕсли;
//
// 2. Схема зависит от значения параметра, выведенного в пользовательские настройки отчета:
//	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
//		ПолноеИмяОбъектаМетаданных = "";
//		Для Каждого ЭлементКД Из НовыеПользовательскиеНастройкиКД.Элементы Цикл
//			Если ТипЗнч(ЭлементКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
//				ИмяПараметра = Строка(ЭлементКД.Параметр);
//				Если ИмяПараметра = "ОбъектМетаданных" Тогда
//					ПолноеИмяОбъектаМетаданных = ЭлементКД.Значение;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		Если КлючСхемы <> ПолноеИмяОбъектаМетаданных Тогда
//			КлючСхемы = ПолноеИмяОбъектаМетаданных;
//			СхемаКД = Новый СхемаКомпоновкиДанных;
//			// Наполнение схемы...
//			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, 
											НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт

	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
					
		ПараметрОбъектРемонта = ПолучитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "ОбъектРемонта");
		ОбъектРемонта = ПараметрОбъектРемонта.Значение;
		
		Если ЗначениеЗаполнено(ОбъектРемонта) Тогда	
			
			ПериодВыполнения = ПериодВыполненияПоЗаписямПоказателей(ОбъектРемонта);			
			УстановитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодВыполнени", ПериодВыполнения);
  	
			КонтролируемыеПоказатели = ПоказателиПоОР(ОбъектРемонта);
			УстановитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, 
				"КонтролируемыеПоказатели", КонтролируемыеПоказатели);
			
			НовыеПользовательскиеНастройкиКД = КомпоновщикНастроек.ПользовательскиеНастройки;

		КонецЕсли;		
							
	КонецЕсли; 

КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
// Форма - ФормаКлиентскогоПриложения - Форма отчета.
// НовыеПользовательскиеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//
// См. синтакс - помощник "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс - помощнике.
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПараметрыВыполнения = Форма.Параметры;
						
	Если ПараметрыВыполнения.Свойство("ОбъектРемонта") Тогда
		ОбъектРемонта = ПараметрыВыполнения.ОбъектРемонта;			
		УстановитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "ОбъектРемонта", ОбъектРемонта);
	КонецЕсли;			

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПериодВыполненияПоЗаписямПоказателей(ОбъектРемонта)
	
	ПериодВыполнения = Новый СтандартныйПериод;
	
	Если ОбъектРемонта.ТипОбъекта <> Перечисления.торо_ТипыОбъектовRCM.Объект Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Выберите единицу оборудования!'"));
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ЗначенияСрезПервых.Период) КАК ДатаНачала,
		|	МАКСИМУМ(ЗначенияСрезПоследних.Период) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСрезы
		|ИЗ
		|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПервых(, ОбъектРемонта = &ОбъектРемонта) КАК ЗначенияСрезПервых,
		|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПоследних(, ОбъектРемонта = &ОбъектРемонта) КАК ЗначенияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСрезы.ДатаНачала КАК ДатаНачала,
		|	ВТСрезы.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВТСрезы КАК ВТСрезы
		|ГДЕ
		|	НЕ ВТСрезы.ДатаНачала ЕСТЬ NULL
		|	И НЕ ВТСрезы.ДатаОкончания ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ПериодВыполнения.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
			ПериодВыполнения.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;	
		КонецЕсли;
	КонецЕсли;

	Возврат ПериодВыполнения;
		
КонецФункции	 

Функция ПоказателиПоОР(ОбъектРемонта)
	
	КонтролируемыеПоказатели = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзмеряемыеПоказателиОР.Показатель КАК Показатель
	               |ИЗ
	               |	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ИзмеряемыеПоказателиОР
	               |ГДЕ
	               |	ИзмеряемыеПоказателиОР.ОбъектРемонта = &ОбъектРемонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИзмеряемыеПоказателиОР.Показатель";
	Запрос.Параметры.Вставить("ОбъектРемонта", ОбъектРемонта);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПоказателей = РезультатЗапроса.Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаПоказателей Цикл
		КонтролируемыеПоказатели.Добавить(ТекСтрока.Показатель);
	КонецЦикла;	

	Возврат КонтролируемыеПоказатели;
	
КонецФункции

// Возвращает значение параметра компоновки данных
//
// Параметры:
//	ОбъектНастройки - НастройкиКомпоновкиДанных - объект настройки.
//					- ПользовательскиеНастройкиКомпоновкиДанных -
//					- КомпоновщикНастроекКомпоновкиДанных -
//					- НастройкиВложенногоОбъектаКомпоновкиДанных -
//					- ДанныеРасшифровкиКомпоновкиДанных -
//					- КоллекцияЗначенийПараметровКомпоновкиДанных -
//					- ОформлениеКомпоновкиДанных -
//	Параметр		- Строка, ПараметрКомпоновкиДанных - поле или имя поля, для которого нужно вернуть параметр.
//
// Возвращаемое значение:
//	ЗначениеПараметраНастроекКомпоновкиДанных - Неопределено, если параметр не найден.
//
Функция ПолучитьПараметр(ОбъектНастройки, Параметр) 
	
	ЗначениеПараметра = Неопределено;
	ПолеПараметр = Новый ПараметрКомпоновкиДанных(Параметр);
	
	Для Каждого ЭлементНастройки Из ОбъектНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И ЭлементНастройки.Параметр = ПолеПараметр Тогда
			ЗначениеПараметра = ЭлементНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Возврат ЗначениеПараметра;
	
КонецФункции

// Устанавливает параметр настроек компоновки данных
//
// Параметры:
//	Настройки - НастройкиКомпоновкиДанных -
//				- ПользовательскиеНастройкиКомпоновкиДанных -
//				- КомпоновщикНастроекКомпоновкиДанных - настройки КД, для которых требуется установить параметры.
//	Параметр - Строка, ПараметрКомпоновкиДанных - параметр, который требуется установить
//	Значение - Произвольный - значение, которое требуется установить.
//	Использование - Булево - признак использования параметра КД.
//	Недоступный - Булево - Истина, если элемент настройки не предназначен для изменения в составе пользовательской настройки.
//
Процедура УстановитьПараметр(Настройки, Параметр, Значение, Использование = Истина, Недоступный = Ложь) 
	
	ЗначениеПараметра = ПолучитьПараметр(Настройки, Параметр);
	
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Значение		= Значение;
		ЗначениеПараметра.Использование	= Использование;
		Если Недоступный Тогда
			ЗначениеПараметра.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗагрузитьНастройкиПриИзмененииПараметров()  
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ОбъектРемонта"));	
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
